app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."category_id" IN (1, 4, 5, 6)
---
	def show
	  @category = Category.find(params[:id])
	  @notes = Note.where(category_id: @category.subtree_ids)